Greendogo/EECS690_Project01/FreeRTOS823_3_TM4C1294_Base_Test/Tasks/Task_PID.c
#include	"inc/hw_ints.h"
#include	"inc/hw_memmap.h"
#include	"inc/hw_types.h"
#include	"inc/hw_uart.h"

#include	<stddef.h>
#include	<stdbool.h>
#include	<stdint.h>
#include	<stdarg.h>
#include <Tasks/Task_tempConvert.h>

#include	"driverlib/sysctl.h"
#include	"driverlib/pin_map.h"
#include	"driverlib/gpio.h"

#include	"FreeRTOS.h"
#include 	"queue.h"
#include	"task.h"
#include "utils/uartstdio.h"

extern QueueHandle_t queue2;//
extern QueueHandle_t queue3;//

float	previous_error;
float	integral;
float	error;
float	derivative;
float	output;
float	dt=(250* configTICK_RATE_HZ)/1000;
float	desiredTemp=30;
float	currentTemp;
//control variables
float	kp=1;
float	ki=1;
float	kd=1;


struct dataPacket {
	uint32_t timeStamp;
	uint32_t ADC_Value;
	float tempValue;
	float error;
} dataPacket;

struct dataPacket store;

extern void Task_PID( void *pvParameters ) {

	while(1){
		if(xQueueReceive(queue2,&store,0))
		{
			//Receive Input
			//xQueueReceive(queue2,&store,0);//update current temp from convertTemp task

			//Calculations
			error=desiredTemp-store.tempValue;
			integral=integral+error/(dt);
			derivative=(error-previous_error)/dt;
			output= kp*error+ki*error+kd*error;
			previous_error=error;
			store.error = error;
			//Output
			xQueueSendToBack(queue3, &store, 0);//
//			UARTprintf( ", %d\n", error);//
//			UARTprintf("%d, %d, %d\n", store.ADC_Value, store.tempValue, store.error);
		}
		vTaskDelay(dt);
	}

}
